
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ОП_ОбработкаПроведения(Отказ, РежимПроведения)

#Вставка
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
#КонецВставки

	// Создание движений в регистре накопления ОстаткиТоваров
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для каждого СтрокаТовары Из Товары Цикл

		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = СтрокаТовары.Товар;
		Движение.Склад = Склад;
		Движение.Количество = СтрокаТовары.Количество;

	КонецЦикла;

#Вставка
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ПриходТовара.Проведение", ВремяНачалаЗамера, Товары.Количество(), "Вес по табличной части ""Товары""");
#КонецВставки

КонецПроцедуры
