#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие из КлючИЗначение:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Пример инициализации:
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Пример использования:
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

#КонецОбласти  

#Область ОбработчикиСобытий

&После("ПередНачаломРаботыСистемы")
Процедура ОП_ПередНачаломРаботыСистемы(Отказ)
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПараметрыПриложения = Новый Соответствие;
	ПараметрыПриложения.Вставить("СтандартныеПодсистемы.ОценкаПроизводительности.ВремяНачалаЗапуска", ВремяНачала);
	
	// СтандартныеПодсистемы
	Параметры = Новый Структура;
	ОценкаПроизводительностиКлиент.ПередНачаломРаботыСистемы(Параметры);
	// Конец СтандартныеПодсистемы
	
	//Параметры = Новый Структура;
	ОценкаПроизводительностиВызовСервера.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры); 
	
КонецПроцедуры

#КонецОбласти
